'''
题目描述：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高
　　　于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提
　　　成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于
　　　40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于
　　　100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。　　　　　　
        I <= 100000   10%
          <= 200000   7.5%
          <= 400000   5%
          <= 600000   3%
          <= 1000000  1.5%
          超过1000000  1%   
'''

bonus_100000 = 100000 * 0.1
bonus_200000 = bonus_100000 + 100000 * 0.075
bonus_400000 = bonus_200000 + 200000 * 0.05
bonus_600000 = bonus_400000 + 200000 * 0.03
bonus_1000000 = bonus_600000 + 400000 * 0.015

I = int(input())

if I <= 100000:
    bonus = I * 0.1
elif I <= 200000:
    bonus = bonus_100000 + (I - 100000) * 0.075
elif I <= 400000:
    bonus = bonus_200000 + (I - 200000) * 0.05
elif I <= 600000:
    bonus = bonus_400000 + (I - 400000) * 0.03
elif I <= 1000000:
    bonus = bonus_600000 + (I - 600000) * 0.015
else:
    bonus = bonus_1000000 + (I - 1000000) * 0.01

print(bonus)